IRP/src/Documents/ChequeBondTransaction/ChequeBondTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ChequeBondTransaction</name>
  <registerRecords>InformationRegister.ChequeBondStatuses</registerRecords>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ChequeBonds</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Cheque</name>
      <type>
        <types>CatalogRef.ChequeBonds</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>CatalogRef.ObjectStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>Agreement</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>CashAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Bank</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>NewStatus</name>
      <type>
        <types>CatalogRef.ObjectStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PaymentList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>PartnerArBasisDocument</name>
      <type>
        <types>DefinedType.typeArTransactionBasises</types>
      </type>
    </attributes>
    <attributes>
      <name>PartnerApBasisDocument</name>
      <type>
        <types>DefinedType.typeApTransactionBasises</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/ChequeBondTransaction/ObjectModule.bsl
Procedure Posting(Cancel, PostingMode)
	
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
	Synhronize("Post", Cancel);
	
EndProcedure

Procedure UndoPosting(Cancel)
	
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
	Synhronize("Unpost", Cancel);
	
EndProcedure

Procedure BeforeDelete(Cancel)
	
	Synhronize("Delete", Cancel);
	
EndProcedure

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If Not ThisObject.AdditionalProperties.Property("DelayedSynhronization") Then
		ThisObject.AdditionalProperties.Insert("DelayedSynhronization", New Array());
	EndIf;
	
	If Not ThisObject.Ref.DeletionMark And ThisObject.DeletionMark Then
		ThisObject.AdditionalProperties.DelayedSynhronization.Add("SetDeletionMark");
	EndIf;
	If ThisObject.Ref.DeletionMark And Not ThisObject.DeletionMark Then
		ThisObject.AdditionalProperties.DelayedSynhronization.Add("UnsetDeletionMark");
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If ThisObject.AdditionalProperties.Property("DelayedSynhronization") Then
		For Each ItemOfDelayedSynhronization In ThisObject.AdditionalProperties.DelayedSynhronization Do
			Synhronize(ItemOfDelayedSynhronization, Cancel);
		EndDo;
	EndIf;
EndProcedure

Procedure Synhronize(Event, Cancel)
	ArrayOfCheque = ThisObject.ChequeBonds.UnloadColumn("Cheque");
	Try
		DataLock = New DataLock();
		If Event = "Post" Then
			Documents.ChequeBondTransactionItem.PostDocuments(DataLock, ArrayOfCheque, ThisObject.Ref);
		ElsIf Event = "Unpost" Then
			Documents.ChequeBondTransactionItem.UnpostDocuments(DataLock, ArrayOfCheque, ThisObject.Ref);
		ElsIf Event = "Delete" Then
			Documents.ChequeBondTransactionItem.DeleteDocuments(DataLock, ArrayOfCheque, ThisObject.Ref);
		ElsIf Event = "SetDeletionMark" Then
			Documents.ChequeBondTransactionItem.SetDeletionMarkForDocuments(DataLock, ArrayOfCheque, ThisObject.Ref);
		ElsIf Event = "UnsetDeletionMark" Then
			Documents.ChequeBondTransactionItem.UnsetDeletionMerkForDocuments(DataLock, ArrayOfCheque, ThisObject.Ref);
		Else
			CommonFunctionsClientServer.ShowUsersMessage(R()["Error_032"]);
		EndIf;
	Except
		
		CommonFunctionsClientServer.ShowUsersMessage(ErrorDescription());
		
	EndTry;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	Text = R()["Error_030"];
	
	For Each RowChequeBond In ChequeBonds Do
		
		If DocChequeBondTransactionServer.CheckRowChequeBond(RowChequeBond.NewStatus, RowChequeBond.CashAccount) Then
			
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(Text, Metadata.Catalogs.CashAccounts.Synonym, 
																		"" + RowChequeBond.LineNumber,  
																		Metadata.Catalogs.ChequeBonds.Synonym),
																		"ChequeBonds[" + (RowChequeBond.LineNumber - 1) + "].CashAccount",
																		ThisObject);
		EndIf;
		
	EndDo;
	
EndProcedure
